---
kind: other
id: Properties.T:Autodesk.Revit.DB.TypeBinding
source: html/59dbc81f-5538-b0a5-f70f-f4205ac83447.htm
---
# TypeBinding Properties

Retrieve or set the categories to which a parameter definition will be bound.